{
  "projects": [
    {
      "visible": true,
      "category": "Pocket Calculator Emoji LOGIC, GENERAL PROGRAMMING",
      "title": "Basic Retro Calculator APP",
      "description": "Not as simple as it looks!  Lot's of detail in writing this program.  I spent a lot of time going through each element of the code line by line to get it to work. This was a huge challenge for me, as often when one thing was fixed it broke something else.  Or when everything up until that point worked, I would add a new thing and the program would fail.  This program was a tricky balancing act that tested my resolve as a programmer.  I learned quite a lot with this program and though it took me quite a few weeks to put it together I have come out of it a much stronger an more capable programmer.  I learned how to work more closely with event handlers.  I learned how to debug in an event driven program, while getting lot's of practice working through the logic to make it all work.  So, without further adiou, go to the github page, and enjoy!",
      "tags": [
        "JavaScript",
        "HTML",
        "CSS"
      ],
      "image": {
        "src": "../../images/Calculator-Screen-Shot.jpg",
        "alt": "Quick Setup",
        "linkTo": "https://ashergreen82.github.io/Calculator-App/"
      },
      "links": [
        {
          "type": "github",
          "url": "https://github.com/ashergreen82/Calculator-App.git"
        },
        {
          "type": "external",
          "url": "https://ashergreen82.github.io/Calculator-App/"
        }
      ]
    },
    {
      "visible": true,
      "category": "FRAMEWORKS, LOCAL STORAGE",
      "title": "Simple Expense Tracker",
      "description": "I wrote this program to learn React.  This is my first time ever using a framework. It was an experience learning it's intracacies, so much so, that at some point I was wondering why we even have frameworks.  I am starting to see the value in using a framework the more I use it.  I will be using it on my next project to gain more experience with it. I also learned Bootstrap 5.  The first is how CSS reacts with Bootstrap.  I started using CSS style things and when I introduced Bootstrap, I spent hours tryhing to figure out why things refused to work. So, I removed the CSS, and stuck with Bootstrap and then things started working.",
      "tags": [
        "JavaScript",
        "Bootstrap",
        "React"
      ],
      "image": {
        "src": "../../images/expense_tracker_screenshot.jpg",
        "alt": "Extendable Layout",
        "linkTo": "https://63c2f2489ccdc732de19a7b5--bucolic-froyo-de7845.netlify.app/"
      },
      "links": [
        {
          "type": "github",
          "url": "https://github.com/ashergreen82/Expense-Tracker.git"
        },
        {
          "type": "external",
          "url": "https://63c2f2489ccdc732de19a7b5--bucolic-froyo-de7845.netlify.app/"
        }
      ]
    },
    {
      "visible": true,
      "category": "FRAMEWORKS, ACCESSING EXTERNAL DATA",
      "title": "Star Wars API",
      "description": "What better way to learn how APIs work then through a free open source API such as the Star Wars API?  That is the purpose for me writing the Star Wars API app.  I continued my education with React and Javascript along with Bootstrap 5.  This time however, I didn't use much CSS.  I just used strictly Bootstrap to get a feel for Bootstrap and it's capabilities.  I learned from my last project that the CSS has a hiarchy as to what commands are executed which is why I had so much trouble getting things styled. In this app, I used this knowledge to make my life easier and turn the app into what it is. The big thing I learned in this project was learning promises.  Promises are a complicated concept best learned by using it.  And this is what I have accomplished in project.  I used Axios library to access the Star Wars data. The next big thing was manipulating the data to display on the screen.  For example, each human in the database is listed as blank in the \"species\" column.  I had to add the \"Human\" word to replace the blank field. I learned how to make a button appear or disappear when it's needed, which is what I did for the previous and next buttons.  I managed to figure out how to get the page navigation bar at the bottom to only show the buttons that actually contain data in it to show.  All in all, this project was an amazing learning experience, and I enjoyed every minute of it.",
      "tags": [
        "JavaScript",
        "HTML",
        "CSS",
        "React",
        "Bootstrap"
      ],
      "image": {
        "src": "../../images/SWAPIAPI.jpg",
        "alt": "Extendable Layout",
        "linkTo": "https://63df0376955c2d0c34ae0ba1--silly-brigadeiros-d326dd.netlify.app/"
      },
      "links": [
        {
          "type": "github",
          "url": "https://github.com/ashergreen82/Star-Wars-API.git"
        },
        {
          "type": "external",
          "url": "https://63df0376955c2d0c34ae0ba1--silly-brigadeiros-d326dd.netlify.app/"
        }
      ]
    },
    {
      "visible": true,
      "category": "PYTHON, OBJECT ORIENTRED PROGRAMING",
      "title": "Classic Hangman Game",
      "description": "Looking for projects to work on, I found a website that had a nice list of projects and one of them was Hangman. This brought back memories, because back when I was young, Hangman was one of the classic favourits we used to play on those old 8 bit computers.  One of the most important lessons I learned while programming this was file manipulation.  The game uses a large file I donwloaded off the internet which contains over 200, 000 words to choose from.  So I had to access the file and select one of the words from the file and use that as the word the player has to guess. I also wrote the program using the object oriented model of programming which is new to me.  I had never programmed in OOP before and this was a great learning opportunity.",
      "tags": [
        "Python"
      ],
      "image": {
        "src": "../../images/screenshot-shifted.png",
        "alt": "Extendable Layout",
        "linkTo": "https://replit.com/@AsherGreen/Hangman?v=1"
      },
      "links": [
        {
          "type": "github",
          "url": "https://github.com/ashergreen82/Hangman"
        },
        {
          "type": "external",
          "url": "https://replit.com/@AsherGreen/Hangman?v=1"
        }
      ]
    },
    {
      "visible": true,
      "category": "PYTHON PYTHON LIBRARIES",
      "title": "Passcode Grid",
      "description": "While I was doing my taxes last year, the CRA had offered an option to use a passcode grid as part of the authenication process.  I thought to myself \"Hey!  I Can do that!!!\", so I got to work. The grid works by you storing a copy on your comptuer somewhere safe, and it stores a copy in your profile.  After you login with your username and password it will then randomly ask you to type in the characters found in say A1.  It will ask three times.  The questions are random, so you have to have the whole chart with you.  To demonstrate how this works, I added a routine after the chart is created randomly asking for what is in each cell.",
      "tags": [
        "Python"
      ],
      "image": {
        "src": "../../images/passcode_screenshot.png",
        "alt": "Extendable Layout",
        "linkTo": "https://replit.com/@AsherGreen/PasscodeGrid?v=1"
      },
      "links": [
        {
          "type": "github",
          "url": "https://github.com/ashergreen82/PasscodeGrid"
        },
        {
          "type": "external",
          "url": "https://replit.com/@AsherGreen/PasscodeGrid?v=1"
        }
      ]
    },
    {
      "visible": false,
      "category": "🧰 EXTENDABLE LAYOUT",
      "title": "Add more sections!",
      "description": "The starter includes predefined sections as well as a template for new, custom sections. Moreover, you can add new projects to this section without additional coding. Photo by Kelly Sikkema on Unsplash.",
      "tags": [
        "Python"
      ],
      "image": {
        "src": "../../images/kelly-sikkema-Hl3LUdyKRic-unsplash.jpg",
        "alt": "Extendable Layout"
      },
      "links": [
        {
          "type": "github",
          "url": "https://github.com/ashergreen82"
        }
      ]
    },
    {
      "visible": false,
      "category": "🧰 EXTENDABLE LAYOUT",
      "title": "Add more sections!",
      "description": "The starter includes predefined sections as well as a template for new, custom sections. Moreover, you can add new projects to this section without additional coding. Photo by Kelly Sikkema on Unsplash.",
      "tags": [
        "Python"
      ],
      "image": {
        "src": "../../images/kelly-sikkema-Hl3LUdyKRic-unsplash.jpg",
        "alt": "Extendable Layout"
      },
      "links": [
        {
          "type": "github",
          "url": "https://github.com/ashergreen82"
        }
      ]
    }
  ],
  "button": {
    "visible": true,
    "label": "Visit on Github",
    "url": "https://github.com/ashergreen82"
  }
}